> @xiaxyi adding one more issue:#19316

Using the middleware suggested in the mentioned issue causes the access policy to be recreated everytime.

```
  # module.module.keyvault_access_policy.azurerm_key_vault_access_policy.secret must be replaced
-/+ resource "azurerm_key_vault_access_policy" "secret" {
      ~ id                      = "/subscriptions/************************************/resourceGroups/**************/providers/Microsoft.KeyVault/vaults/**************-az-vault/objectId/e2984e34-46a3-46d5-9083-5c46738a7a67" -> (known after apply)
      ~ object_id               = "e2984e34-46a3-46d5-9083-5c46738a7a67" -> (known after apply) # forces replacement
      ~ tenant_id               = "************************************" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }
```



```
resource "azurerm_linux_function_app" "fn_trigger" {
  name                = "${var.environment}-function-app"
  resource_group_name = module.rsg.name
  location            = var.az_region
  service_plan_id     = var.asp_function_plan_id

  identity {
    type = "SystemAssigned"
  }

  storage_account_name       = var.storage_account.name
  storage_account_access_key = var.storage_account.access_key

  site_config {
    always_on                              = true
    application_stack {
      dotnet_version = "6.0"
    }
  }

  lifecycle {
    ignore_changes = [
      app_settings["WEBSITE_RUN_FROM_PACKAGE"],
      tags["hidden-link: /app-insights-instrumentation-key"],
      tags["hidden-link: /app-insights-resource-id"],
      tags["hidden-link: /app-insights-conn-string"]
    ]
  }

  tags = merge(local.common_tags, var.custom_tags)

}

data "azurerm_linux_function_app" "fn" {
  name                = azurerm_linux_function_app.fn_trigger.name
  resource_group_name = module.rsg.name
}

module "keyvault_access_policy" {
  source                  = "../../modules/keyvault_access_policy"
  tenant_id               = data.azurerm_linux_function_app.fn.identity.0.tenant_id
  key_vault_id            = azurerm_key_vault_secret.portal_client_id.key_vault_id
  object_id               = data.azurerm_linux_function_app.fn.identity.0.principal_id
  certificate_permissions = ["Get", "List"]
  key_permissions         = []
  secret_permissions      = ["Get", "List"]
  storage_permissions     = []
}


/*
  ...
  Keyvault_access_policy module is defined as
  ...
*/
resource "azurerm_key_vault_access_policy" "secret" {
  key_vault_id = var.key_vault_id
  tenant_id    = var.tenant_id
  object_id    = var.object_id

  certificate_permissions = var.certificate_permissions
  key_permissions         = var.key_permissions
  secret_permissions      = var.secret_permissions
  storage_permissions     = var.storage_permissions
}
```

